tap "homebrew/bundle"
tap "homebrew/services"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "ca-certificates"
brew "grpc"
brew "mpdecimal"
brew "python@3.12"
brew "llvm"
brew "apache-arrow"
brew "aws-vault"
brew "python@3.11"
brew "awscli"
brew "bash-completion"
brew "harfbuzz"
brew "bfg"
brew "unbound"
brew "gnutls"
brew "colima", restart_service: true
brew "coursier"
brew "ctags"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx", link: false
brew "docker-compose", link: false
brew "docker-squash"
brew "eksctl"
brew "libgit2"
brew "exa"
brew "fd"
brew "frum"
brew "gawk"
brew "gnupg", link: false
brew "gpgme"
brew "libheif"
brew "libpq"
brew "libxml2"
brew "numpy"
brew "poppler"
brew "gdal"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "helm"
brew "imagemagick"
brew "istioctl"
brew "jq"
brew "k9s"
brew "ktlint"
brew "kube-ps1"
brew "kubectx"
brew "kubeseal"
brew "libyaml"
brew "maven"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "nvm"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql@14", restart_service: true
brew "postgis"
brew "postgresql@11"
brew "postgresql@13"
brew "pre-commit"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.9"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "ruby-build"
brew "saml2aws"
brew "shellcheck"
brew "talisman"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "tree"
brew "trivy"
brew "typescript"
brew "watch"
brew "webpack"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
cask "adobe-acrobat-reader"
cask "citrix-workspace"
cask "google-cloud-sdk"
cask "insomnia"
cask "keeper-password-manager"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "pgadmin4"
cask "session-manager-plugin"
cask "webex"
vscode "claudiospizzi.scratch-manager"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mathiasfrohlich.kotlin"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "redhat.java"
vscode "richardkotze.git-mob"
vscode "shivanshu-gupta.scratchpads"
vscode "tonybaloney.vscode-pets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
