tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
brew "xz"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "ca-certificates"
brew "cryptography"
brew "python@3.12"
brew "awscli"
brew "bash-completion"
brew "glib"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "coursier"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "libssh2"
brew "libgit2"
brew "eza"
brew "fd"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gpgme"
brew "grpc"
brew "helm"
brew "istioctl"
brew "jq"
brew "k9s"
brew "ktlint"
brew "kube-ps1"
brew "kubectx"
brew "kubeseal"
brew "libheif"
brew "libpq"
brew "libxml2"
brew "libyaml"
brew "llvm"
brew "miller"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openapi-generator"
brew "pinentry-mac"
brew "pipenv"
brew "poetry"
brew "postgresql@13"
brew "pre-commit"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "python@3.9"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "spaceship"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "trivy"
brew "twine"
brew "typescript"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
cask "caffeine"
cask "google-chrome"
cask "headlamp"
cask "intellij-idea-ce"
cask "itsycal"
cask "keeper-password-manager"
cask "openlens"
cask "session-manager-plugin"
cask "visual-studio-code"
cask "zoom"
vscode "buenon.scratchpads"
vscode "claudiospizzi.scratch-manager"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "pulumi.pulumi-lsp-client"
vscode "redhat.java"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
