tap "gastownhall/gascity"
tap "hashicorp/tap"
tap "mongodb/brew"
brew "xz"
brew "python@3.13"
brew "azure-cli"
brew "bat"
brew "freetype"
brew "fontconfig"
brew "icu4c@78"
brew "zstd"
brew "node"
brew "ccusage"
brew "cloc"
brew "cmake"
brew "colima", restart_service: :changed
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "flock"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "go"
brew "handbrake"
brew "helix"
brew "helm"
brew "helm-ls"
brew "httpie"
brew "jq"
brew "k6"
brew "k9s"
brew "kubectx"
brew "kubeseal"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "pure"
brew "python-tk@3.13"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "tfenv"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yaml-language-server"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "gastownhall/gascity/gascity"
brew "hashicorp/tap/packer"
brew "mongodb/brew/mongodb-database-tools"
cask "claude-code"
cask "codex"
cask "coteditor"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "itsycal"
cask "lens"
cask "macfuse"
cask "mongodb-compass"
cask "openlens"
cask "pgadmin4"
cask "slack"
cask "tailscale-app"
cask "zoom"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/gastownhall/gascity/cmd/gc"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/jwp23/joepass"
go "github.com/jwp23/kanteto"
go "github.com/jwp23/kanteto/cmd/kt"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/jwp23/throwntom/v3/cmd/throwntom"
npm "corepack"
